{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# PART C"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase\n",
    "\n",
    "URI = \"neo4j://localhost\"\n",
    "AUTH = (\"neo4j\", \"12345678\")\n",
    "\n",
    "driver = GraphDatabase.driver(URI, auth=AUTH)\n",
    "driver.verify_connectivity()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "STEP1: Create the Database Community Node"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Define a function to create the Database Community node\n",
    "def create_database_community(tx):\n",
    "    tx.run(\"MERGE (:Community {name: 'Database Community'})\")\n",
    "\n",
    "# Execute the function within a session\n",
    "with driver.session() as session:\n",
    "    session.execute_write(create_database_community)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "STEP2: Match Keywords for Database Community \n",
    "1. data management,indexing,data modeling,big data,data processing,data storage,data querying --> Computer Science"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [],
   "source": [
    "def relate_keywords_to_community(tx):\n",
    "    tx.run(\"\"\"\n",
    "    MATCH (kw:Keyword), (dbComm:Community {name: 'Database Community'})\n",
    "    WHERE kw.name IN ['data management', 'indexing', 'data modeling', 'big data', 'data processing', 'data storage', 'data querying']\n",
    "      AND kw.domain = 'Computer Science'\n",
    "    CREATE (kw)-[:DEFINES]->(dbComm)\n",
    "    \"\"\")\n",
    "\n",
    "# Execute the function within a session\n",
    "with driver.session() as session:\n",
    "    session.execute_write(relate_keywords_to_community)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Keyword: data management added into Database Community\n",
      "Keyword: indexing added into Database Community\n",
      "Keyword: data modeling added into Database Community\n",
      "Keyword: big data added into Database Community\n",
      "Keyword: data processing added into Database Community\n",
      "Keyword: data storage added into Database Community\n",
      "Keyword: data querying added into Database Community\n"
     ]
    }
   ],
   "source": [
    "def create_keywords_and_relate_to_community(tx):\n",
    "    # Ensure the Database Community node exists\n",
    "    tx.run(\"MERGE (:Community {name: 'Database Community'})\")\n",
    "    \n",
    "    # List of keywords related to the Database Community\n",
    "    keywords = [\n",
    "        'data management', 'indexing', 'data modeling', \n",
    "        'big data', 'data processing', 'data storage', 'data querying'\n",
    "    ]\n",
    "    \n",
    "    for keyword in keywords:\n",
    "        # Create the keyword if it doesn't exist and relate it to the Database Community\n",
    "        tx.run(\"\"\"\n",
    "            MERGE (kw:Keyword {name: $keyword, domain: 'Computer Science'})\n",
    "            WITH kw\n",
    "            MATCH (dbComm:Community {name: 'Database Community'})\n",
    "            MERGE (kw)-[:DEFINES]->(dbComm)\n",
    "            \"\"\", keyword=keyword)\n",
    "        print(\"Keyword:\",keyword, \"added into Database Community\",)\n",
    "\n",
    "with driver.session() as session:\n",
    "    session.execute_write(create_keywords_and_relate_to_community)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "(keyword)--[:DEFINES]--(Database Community)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "STEP 3: RELATE database community with computer science keywords "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Relationship is sucessfully established\n"
     ]
    }
   ],
   "source": [
    "def create_and_return_cs_keyword_relationships(tx):\n",
    "    results = tx.run(\"\"\"\n",
    "    MATCH (kw:keywords {domain: 'Computer Science'}), (dbComm:Community {name: 'Database Community'})\n",
    "    MERGE (kw)-[r:RELATED_TO]->(dbComm)\n",
    "    RETURN kw.name AS keyword, dbComm.name AS community\n",
    "    \"\"\")\n",
    "    return results.values()\n",
    "\n",
    "# Execute the function within a session and print the results\n",
    "with driver.session() as session:\n",
    "    relationships = session.execute_write(create_and_return_cs_keyword_relationships)\n",
    "    print(\"Relationship is sucessfully established\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "(keywords {domain:\"Computer Science\"})-[:RELATED_TO]-(Database Community)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "STEP4:Find Conferences and Journals Related to the Database Community\n",
    "#To consider a conference or journal related to the database community, at least 90% of its published papers must contain one of the keywords defining the community."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [],
   "source": [
    "def find_related_conferences_and_journals(tx):\n",
    "    query = \"\"\"\n",
    "    MATCH (p:Paper)-[:HAS]->(kw:Keyword)\n",
    "    WHERE kw.name IN ['data management', 'indexing', 'data modeling', 'big data', 'data processing', 'data storage', 'data querying']\n",
    "    WITH p, COLLECT(kw.name) AS keywords\n",
    "    MATCH (p)-[:PUBLISHED_IN]->(pub)\n",
    "    WITH pub, COUNT(p) AS totalPapers, COUNT(keywords) AS keywordPapers\n",
    "    WHERE keywordPapers >= 0.9 * totalPapers\n",
    "    SET pub:RelatedToDatabaseCommunity\n",
    "    RETURN pub\n",
    "    \"\"\"\n",
    "    return list(tx.run(query))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "STEP 5:Finding Conferences and Journals where a high percentage of papers are associated with the keywords defined by the Database Community.  "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Publication: IEEE Transactions on Software Engineering, Papers with Keywords: 7, Total Papers: 7\n",
      "Publication: IEEE Software, Papers with Keywords: 6, Total Papers: 6\n",
      "Publication: IEEE Transactions on Knowledge and Data Engineering, Papers with Keywords: 30, Total Papers: 33\n",
      "Publication: Communications of the ACM, Papers with Keywords: 2, Total Papers: 2\n",
      "Publication: PeerJ, Papers with Keywords: 1, Total Papers: 1\n",
      "Publication: Patterns, Papers with Keywords: 1, Total Papers: 1\n",
      "Publication: IEEE Transactions on Affective Computing, Papers with Keywords: 1, Total Papers: 1\n",
      "Publication: Protein Science, Papers with Keywords: 2, Total Papers: 2\n",
      "Publication: Empirical Software Engineering, Papers with Keywords: 13, Total Papers: 13\n",
      "Publication: Computer, Papers with Keywords: 1, Total Papers: 1\n",
      "Publication: Cambridge International Law Journal, Papers with Keywords: 1, Total Papers: 1\n",
      "Publication: GigaScience, Papers with Keywords: 1, Total Papers: 1\n",
      "Publication: Physical Review Letters, Papers with Keywords: 1, Total Papers: 1\n",
      "Publication: PLoS ONE, Papers with Keywords: 1, Total Papers: 1\n",
      "Publication: Journal of Geographical Systems, Papers with Keywords: 1, Total Papers: 1\n",
      "Publication: BioScience, Papers with Keywords: 1, Total Papers: 1\n",
      "Publication: Computer/law journal, Papers with Keywords: 1, Total Papers: 1\n",
      "Publication: Journal of Biosciences, Papers with Keywords: 1, Total Papers: 1\n",
      "Publication: Communications in Computer and Information Science, Papers with Keywords: 1, Total Papers: 1\n",
      "Publication: Scientific Data, Papers with Keywords: 3, Total Papers: 3\n",
      "Publication: Biomedical Optics Express, Papers with Keywords: 2, Total Papers: 2\n",
      "Publication: ACM Transactions on Software Engineering and Methodology, Papers with Keywords: 1, Total Papers: 1\n",
      "Publication: Journal of combinatorial theory. Series B (Print), Papers with Keywords: 1, Total Papers: 1\n",
      "Publication: IEEE Transactions on Information Theory, Papers with Keywords: 1, Total Papers: 1\n",
      "Publication: BMC Bioinformatics, Papers with Keywords: 5, Total Papers: 5\n",
      "Publication: Journal of Molecular Biology, Papers with Keywords: 2, Total Papers: 2\n",
      "Publication: Analytical and Bioanalytical Chemistry, Papers with Keywords: 1, Total Papers: 1\n",
      "Publication: BioData Mining, Papers with Keywords: 1, Total Papers: 1\n",
      "Publication: Information and Software Technology, Papers with Keywords: 4, Total Papers: 4\n",
      "Publication: Chemical Reviews, Papers with Keywords: 1, Total Papers: 1\n",
      "Publication: Frontiers in Neuroscience, Papers with Keywords: 1, Total Papers: 1\n",
      "Publication: Nature Machine Intelligence, Papers with Keywords: 1, Total Papers: 1\n",
      "Publication: Lecture Notes in Computer Science, Papers with Keywords: 2, Total Papers: 2\n",
      "Publication: Journal of Cheminformatics, Papers with Keywords: 1, Total Papers: 1\n",
      "Publication: Proceedings of the VLDB Endowment, Papers with Keywords: 1, Total Papers: 1\n",
      "Publication: Geographical Analysis, Papers with Keywords: 2, Total Papers: 2\n",
      "Publication: Neurocomputing, Papers with Keywords: 1, Total Papers: 1\n",
      "Publication: International Journal of Data Science and Analysis, Papers with Keywords: 1, Total Papers: 1\n",
      "Publication: SN Computer Science, Papers with Keywords: 1, Total Papers: 1\n",
      "Publication: Engineering computations, Papers with Keywords: 1, Total Papers: 1\n",
      "Publication: Research Synthesis Methods, Papers with Keywords: 1, Total Papers: 1\n",
      "Publication: Current Topics in Medicinal Chemistry, Papers with Keywords: 1, Total Papers: 1\n",
      "Publication: IEEE Transactions on Pattern Analysis and Machine Intelligence, Papers with Keywords: 2, Total Papers: 2\n",
      "Publication: Journal of Library Administration, Papers with Keywords: 1, Total Papers: 1\n",
      "Publication: Journal of Systems and Software, Papers with Keywords: 4, Total Papers: 4\n",
      "Publication: Journal of Social Computing, Papers with Keywords: 1, Total Papers: 1\n",
      "Publication: Metabolomics, Papers with Keywords: 1, Total Papers: 1\n",
      "Publication: Journal of Biomedical Informatics, Papers with Keywords: 1, Total Papers: 1\n",
      "Publication: Proceedings of the IEEE, Papers with Keywords: 2, Total Papers: 2\n",
      "Publication: Nature Methods, Papers with Keywords: 1, Total Papers: 1\n",
      "Publication: IEEE Transactions on Signal Processing, Papers with Keywords: 1, Total Papers: 1\n",
      "Publication: Journal of Infectious Diseases, Papers with Keywords: 1, Total Papers: 1\n",
      "Publication: Journal of medical systems, Papers with Keywords: 1, Total Papers: 1\n",
      "Publication: British Journal of Educational Technology, Papers with Keywords: 1, Total Papers: 1\n",
      "Publication: CHANCE : New Directions for Statistics and Computing, Papers with Keywords: 1, Total Papers: 1\n",
      "Publication: Journal of Statistics Education, Papers with Keywords: 1, Total Papers: 1\n",
      "Publication: Clinical Chemistry, Papers with Keywords: 1, Total Papers: 1\n",
      "Publication: Saudi Journal of Biological Sciences, Papers with Keywords: 1, Total Papers: 1\n",
      "Publication: International Journal of Digital Earth, Papers with Keywords: 1, Total Papers: 1\n",
      "Publication: Language Resources and Evaluation, Papers with Keywords: 1, Total Papers: 1\n",
      "Publication: Image and Vision Computing, Papers with Keywords: 1, Total Papers: 1\n",
      "Publication: Journal of Software Engineering Research and Development, Papers with Keywords: 1, Total Papers: 1\n",
      "Publication: TOP - An Official Journal of the Spanish Society of Statistics and Operations Research, Papers with Keywords: 1, Total Papers: 1\n",
      "Publication: Journal of Library and Information Sciences, Papers with Keywords: 1, Total Papers: 1\n",
      "Publication: Ethics and Information Technology, Papers with Keywords: 1, Total Papers: 1\n",
      "Publication: Bioscience Reports, Papers with Keywords: 1, Total Papers: 1\n",
      "Publication: Applied and Environmental Microbiology, Papers with Keywords: 1, Total Papers: 1\n",
      "Publication: Analytical Chemistry, Papers with Keywords: 1, Total Papers: 1\n",
      "Publication: International Journal of Computer Vision, Papers with Keywords: 1, Total Papers: 1\n",
      "Publication: Software testing, verification & reliability, Papers with Keywords: 1, Total Papers: 1\n",
      "Publication: Signal processing. Image communication, Papers with Keywords: 1, Total Papers: 1\n",
      "Publication: IEEE Transactions on Artificial Intelligence, Papers with Keywords: 1, Total Papers: 1\n",
      "Publication: Frontiers in Bioengineering and Biotechnology, Papers with Keywords: 1, Total Papers: 1\n",
      "Publication: SpringerPlus, Papers with Keywords: 1, Total Papers: 1\n",
      "Publication: Methods, Papers with Keywords: 1, Total Papers: 1\n",
      "Publication: Dialogues in Clinical Neuroscience, Papers with Keywords: 1, Total Papers: 1\n",
      "Publication: Clinical Microbiology and Infection, Papers with Keywords: 1, Total Papers: 1\n",
      "Publication: Journal of Medical Internet Research, Papers with Keywords: 1, Total Papers: 1\n",
      "Publication: The International Journal of Life Cycle Assessment, Papers with Keywords: 1, Total Papers: 1\n",
      "Publication: Journal of Open Source Software, Papers with Keywords: 1, Total Papers: 1\n",
      "Publication: Bulletin of the Australian Mathematical Society, Papers with Keywords: 1, Total Papers: 1\n",
      "Publication: Transactions of the American Mathematical Society, Papers with Keywords: 1, Total Papers: 1\n",
      "Publication: Proceedings of the Royal Society A, Papers with Keywords: 1, Total Papers: 1\n",
      "Publication: International Journal of Population Data Science, Papers with Keywords: 1, Total Papers: 1\n",
      "Publication: Acta Crystallographica Section B Structural Science, Papers with Keywords: 1, Total Papers: 1\n",
      "Publication: Journal of manufacturing science and engineering, Papers with Keywords: 1, Total Papers: 1\n",
      "Publication: Nature Reviews Neuroscience, Papers with Keywords: 1, Total Papers: 1\n",
      "Publication: Epilepsia, Papers with Keywords: 1, Total Papers: 1\n",
      "Publication: Neurobiology of Aging, Papers with Keywords: 1, Total Papers: 1\n",
      "Publication: The Neuroscientist, Papers with Keywords: 1, Total Papers: 1\n",
      "Publication: Journal of Neuroscience Research, Papers with Keywords: 1, Total Papers: 1\n"
     ]
    }
   ],
   "source": [
    "class DatabaseCommunityRecommender:\n",
    "    def __init__(self, uri, user, password):\n",
    "        self.driver = GraphDatabase.driver(uri, auth=(user, password))\n",
    "\n",
    "    def close(self):\n",
    "        self.driver.close()\n",
    "\n",
    "\n",
    "    def find_related_publications(self):\n",
    "        with self.driver.session() as session:\n",
    "            result = session.execute_write(self._find_and_label_publications)\n",
    "            for record in result:\n",
    "                print(f\"Publication: {record['publication']['name']}, \"\n",
    "                      f\"Papers with Keywords: {record['papersWithKeywords']}, \"\n",
    "                      f\"Total Papers: {record['totalPapers']}\")\n",
    "\n",
    "    @staticmethod\n",
    "    def _find_and_label_publications(tx):\n",
    "        query = \"\"\"\n",
    "        MATCH (c:Community {name: \"Database Community\"})<-[:RELATED_TO]-(kw:keywords)\n",
    "        WITH c, kw\n",
    "        MATCH (kw)<-[:HAS]-(p:paper)\n",
    "        WITH kw, p\n",
    "        MATCH (p)-[:PUBLISHED_IN]->(publication)\n",
    "        WITH publication, COUNT(DISTINCT p) AS papersWithKeywords\n",
    "        MATCH (publication)<-[:PUBLISHED_IN]-(p2:paper)\n",
    "        WITH publication, papersWithKeywords, COUNT(DISTINCT p2) AS totalPapers\n",
    "        WHERE papersWithKeywords >= 0.9 * totalPapers\n",
    "        SET publication:RelatedToDatabaseCommunity\n",
    "        RETURN publication, papersWithKeywords, totalPapers\n",
    "        \"\"\"\n",
    "        results = tx.run(query)\n",
    "        return [{\"publication\": record[\"publication\"], \"papersWithKeywords\": record[\"papersWithKeywords\"], \"totalPapers\": record[\"totalPapers\"]} for record in results]\n",
    "\n",
    "# Usage\n",
    "uri = \"neo4j://localhost:7687\"\n",
    "user = \"neo4j\"\n",
    "password = \"12345678\"\n",
    "recommender = DatabaseCommunityRecommender(uri, user, password)\n",
    "recommender.find_related_publications()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "STEP6: Identifying Top Papers\n",
    "1. Matches papers published in journals and conferences related to the Database Community.\n",
    "2. Calculates the number of citations each paper has received.\n",
    "3. Orders the papers by their citation count in descending order.\n",
    "4. Limits the results to the top 100 papers and labels them as TopPaper.\n",
    "5. Returns the top papers and their citation counts."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "For Removing Top Papers\n",
    "- MATCH (paper:TopPaper)\n",
    "- REMOVE paper:TopPaper\n",
    "- RETURN count(paper) AS totalUpdated"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Top Paper ID: b7599c8ba88e7c93edbce57df513152e8f5693e7 with 50 citations\n",
      "Top Paper ID: 12748e904f5025ca1757ce49d72cad3878e1be8f with 50 citations\n",
      "Top Paper ID: ee4fd9cd27836870dd18eb2d81efac596a758fb1 with 49 citations\n",
      "Top Paper ID: 0c86e8d19d0fc62a5f829ea625ffd3e7fa9551b9 with 49 citations\n",
      "Top Paper ID: 9579ed0d182ba134ab3ed14ba0defbb324147399 with 49 citations\n",
      "Top Paper ID: 590ead4aeddbf8fea8414998b2dc3b74576a71cb with 49 citations\n",
      "Top Paper ID: 1a517c7b56d1d2f2d3e8e209c438e32663a750c9 with 49 citations\n",
      "Top Paper ID: 564614da76b5d9020c700b78e1fe154bd590c47d with 49 citations\n",
      "Top Paper ID: cd8156fc9f17146b39dfaf47fcd20f1e3ab70791 with 48 citations\n",
      "Top Paper ID: 74eb4d6abf1d0236be338c1bd5ee59a498b961b1 with 47 citations\n",
      "Top Paper ID: 27e57cc2f22c1921d2a1c3954d5062e3fe391553 with 47 citations\n",
      "Top Paper ID: bcd2c5379a34068040750a751e4fd2710d90c15c with 47 citations\n",
      "Top Paper ID: d0da9ce3ca989bce2579b64be9aed518265a8994 with 46 citations\n",
      "Top Paper ID: e6a5bcdb576f2b0d965a9f71f24514553966716b with 46 citations\n",
      "Top Paper ID: c24d6c1bed6af6b99e506f2ba83e9552481b5615 with 46 citations\n",
      "Top Paper ID: 305600f3cba8a63bad1bedeab34a299bf748754b with 46 citations\n",
      "Top Paper ID: 389aa97e59372fbc65cab81fe18d9f86fbb70a82 with 46 citations\n",
      "Top Paper ID: 7282f5c9d84cd47c516a6a66c5a6b8f1e2cf44b6 with 45 citations\n",
      "Top Paper ID: abb780f85a1a27919e461efdcc2a77cf1ab46c8b with 45 citations\n",
      "Top Paper ID: fe540ba862a10e06c8b75b751745e8b2d6161c73 with 45 citations\n",
      "Top Paper ID: 41abf43dc718e271299457bce65bccfe3feeb9d6 with 45 citations\n",
      "Top Paper ID: 968ea337e15004a2ed3e1442d7f632a1214e2268 with 44 citations\n",
      "Top Paper ID: f986968735459e789890f24b6b277b0920a9725d with 44 citations\n",
      "Top Paper ID: 0e50bf23cb16ba66e738d88f0fffab75c338e02a with 44 citations\n",
      "Top Paper ID: 0b5b33b7ea1dc12f3e9252ac1852170a6a6775bf with 44 citations\n",
      "Top Paper ID: c176cf31862a7c5b324556e8dc3fdbef2a108391 with 43 citations\n",
      "Top Paper ID: 266aa9741c6559af0c6dcee2e1947ced0385b4bd with 43 citations\n",
      "Top Paper ID: c6309b2aa8706f69b70830ef18147c79be36ba50 with 42 citations\n",
      "Top Paper ID: 2f9a1286e7af4ab7706ad8cfcc8c8742a1964939 with 42 citations\n",
      "Top Paper ID: 4050c80ba36c6f86b0684a59be70182557b0770c with 42 citations\n",
      "Top Paper ID: 9318f9c688debeee0d671faae0f2cc384a673499 with 42 citations\n",
      "Top Paper ID: 36789799e464aa7465125ff8e778939843a0e89b with 41 citations\n",
      "Top Paper ID: 287650fad5a478581f0040ad064e6856c7c13af2 with 41 citations\n",
      "Top Paper ID: c2f21a6b917286c7e904e0f168b53bbaa2bda4ba with 41 citations\n",
      "Top Paper ID: 2157f202c8c89d924dd4da4d1bcf92d16fcd8893 with 40 citations\n",
      "Top Paper ID: e799d31e1c2d80a971c1f956d62b98c0a9f27031 with 40 citations\n",
      "Top Paper ID: bca7c0902f600fa77b1e16d0e093e23f7d75f649 with 40 citations\n",
      "Top Paper ID: 9dd54cd7ce4ebf2e52b762817c2688b56bb9e652 with 39 citations\n",
      "Top Paper ID: ec59569fdee17844ae071be1536a08f937f08c57 with 39 citations\n",
      "Top Paper ID: 27c9101fa2f41ce15100f0f07802bb656eda50ad with 39 citations\n",
      "Top Paper ID: e564e3656395782d0ab9f801bfbe9f9f1a5d34a7 with 38 citations\n",
      "Top Paper ID: 30b71975e26dd2709f58372419b712d97536402f with 38 citations\n",
      "Top Paper ID: 3dcc789f0ecc07500a3539ec3805f80a03412103 with 38 citations\n",
      "Top Paper ID: 247e2ee1a84e25cdc2d0d68811e2ee05ca0bc6a9 with 38 citations\n",
      "Top Paper ID: 6e1ca21d92705c43a285bfbd01391b45c6140ead with 37 citations\n",
      "Top Paper ID: e2055b85dab66c922ccf25a28046e8e559074824 with 37 citations\n",
      "Top Paper ID: 4c6e31458b0b44c1e8bd6e58f7d7e0767f7fde44 with 36 citations\n",
      "Top Paper ID: 678da221aa156807bc2c191ed5f4bcbb0b25d421 with 36 citations\n",
      "Top Paper ID: 4099f2b7a9282e3be30076f2532008e6caeb1c13 with 36 citations\n",
      "Top Paper ID: 02f62fe778f1cdcdeb1e975f84ba054895202c26 with 36 citations\n",
      "Top Paper ID: 260ef5a455afcb8d052866bdf2fb28996ab8bbad with 35 citations\n",
      "Top Paper ID: e1c8f86668d3e37e430f187b7fd91d1643a0a0ff with 35 citations\n",
      "Top Paper ID: bf90a04b8c9a7752bab8cb50c8796393218627d2 with 35 citations\n",
      "Top Paper ID: da1de6fa2d15e50c9e96811217e27a66313bd762 with 35 citations\n",
      "Top Paper ID: 8bba999de25bfb288b3f7f88e1d907aab02638b6 with 35 citations\n",
      "Top Paper ID: 0751d2fa3a54cbbb4d594f2ee47c3aa7e4003a24 with 35 citations\n",
      "Top Paper ID: 89ce4cf020e64bb4c7820b550ed9895525d31872 with 35 citations\n",
      "Top Paper ID: deb4e0c46f2e389ec5e4528f9dcee643bb6a15fa with 34 citations\n",
      "Top Paper ID: 3569c79cf90b203325dd7b8f6c30bacc60f5d30e with 34 citations\n",
      "Top Paper ID: 5a2892f91addeea2f4600d28b23e684be32f5b2c with 33 citations\n",
      "Top Paper ID: 0c2cab97a9ea7cc7f31801d21a19aec82fc9a28c with 33 citations\n",
      "Top Paper ID: 12f62537251cf8eb76fa11c59df68d2211008898 with 33 citations\n",
      "Top Paper ID: a94b761fc2c9c299f5dc4c10d44e6d2bdd9a8267 with 33 citations\n",
      "Top Paper ID: 7eb0399ae7e79449178d7fdaa86059fa0c856edd with 33 citations\n",
      "Top Paper ID: 2392f7f8b64c2016bf57957d51f32b7cef2acbcd with 32 citations\n",
      "Top Paper ID: c016852106ac787678105fd9dd22e57ba620517c with 32 citations\n",
      "Top Paper ID: 63b8ebfe57af400c8bbadc5c111cb5fe71f331bd with 32 citations\n",
      "Top Paper ID: 1ff4bd599b950218f0517fb76ee49ad0599e1c53 with 32 citations\n",
      "Top Paper ID: 0e528eb8167c68930c2e1ab20ab5c14f98446927 with 31 citations\n",
      "Top Paper ID: 5cf0d213f3253cd46673d955209f8463db73cc51 with 31 citations\n",
      "Top Paper ID: 6696681640fb9c9dc5f81ea73a433f09bfe9886a with 30 citations\n",
      "Top Paper ID: 78dbf5d24f1788ec47b723904e85dc68d74d77b7 with 30 citations\n",
      "Top Paper ID: a1b62db5c838df5630b1c238d4862dc69bdbc874 with 30 citations\n",
      "Top Paper ID: f8928221d290a9cdd84d1de52e121373bc836caa with 30 citations\n",
      "Top Paper ID: d2ae0082986d965469ece8c0ebcf4885c84b9ccc with 30 citations\n",
      "Top Paper ID: a59b5da1de93e35bbb26d335ca2247ea710a9315 with 30 citations\n",
      "Top Paper ID: 7b1d8dfb9e6260685d9fbb8c41bfc0a35710fe41 with 30 citations\n",
      "Top Paper ID: 4aeda303fa0b9beae3f6d65e052dace9d4540116 with 29 citations\n",
      "Top Paper ID: bba08b50d33448a3b65b4baf7c0df3c1eca8b10d with 29 citations\n",
      "Top Paper ID: 053e5c1f175cf385fb8ab551e68446e24b3475a5 with 29 citations\n",
      "Top Paper ID: 54006d6fb211a090c98fee9d8103479b022c0db2 with 28 citations\n",
      "Top Paper ID: 3b073a5e7de5513705a7e2a7b1c88d3acbeed82c with 28 citations\n",
      "Top Paper ID: 82620503cacf8ff6f8f3490e7bdf7508f1ab2021 with 28 citations\n",
      "Top Paper ID: ff0e69dad3d3c0c4f77c0ffdfdb986e2bfb1533a with 28 citations\n",
      "Top Paper ID: 863a35bdd1ae803491801e283c2ae79fe973cf68 with 27 citations\n",
      "Top Paper ID: 76e4f5abeb4ad28d1f16c15771aa87241a3ee96d with 27 citations\n",
      "Top Paper ID: 9893595f6950ca1340055da05fd2fae2b7b4dfd3 with 27 citations\n",
      "Top Paper ID: 5a4674e987c2d7c130c5303cbad3f4e4531f3259 with 26 citations\n",
      "Top Paper ID: e1274867d404fd1dbf73a654c217ea5c0c32852c with 26 citations\n",
      "Top Paper ID: a963d05b9d4acd347ad528e7d098eb53d8f555a2 with 26 citations\n",
      "Top Paper ID: 0669286d8d4ca8ec2fdf16b7813157c21eb690be with 26 citations\n",
      "Top Paper ID: dc8b25e35a3acb812beb499844734081722319b4 with 26 citations\n",
      "Top Paper ID: bf12943b1862cbdf556ba1ddcdbc685d4f38a6c3 with 25 citations\n",
      "Top Paper ID: a164044fe875d7d9d23a9f569c5b2c82660add4e with 25 citations\n",
      "Top Paper ID: dc52d1ede1b90bf9d296bc5b34c9310b7eaa99a2 with 25 citations\n",
      "Top Paper ID: 8bd4a8eb93ede5c55c09bed842be671c8cb3413f with 25 citations\n",
      "Top Paper ID: 092c275005ae49dc1303214f6d02d134457c7053 with 25 citations\n",
      "Top Paper ID: 63b35f109c6962247cbbf9458d55082c653f1d9e with 25 citations\n",
      "Top Paper ID: a0672457c2687759fe88a44541cc53c81738c0da with 24 citations\n",
      "Top Paper ID: 747359803e9a734fa4f1338a83121a942f3da60e with 23 citations\n"
     ]
    }
   ],
   "source": [
    "from neo4j import GraphDatabase\n",
    "\n",
    "class toppaper:\n",
    "    def __init__(self, uri, user, password):\n",
    "        self.driver = GraphDatabase.driver(uri, auth=(user, password))\n",
    "\n",
    "    def close(self):\n",
    "        self.driver.close()\n",
    "\n",
    "    def find_top_papers(self):\n",
    "        with self.driver.session() as session:\n",
    "            result = session.run(\"\"\"\n",
    "            MATCH (journal:RelatedToDatabaseCommunity)<-[:PUBLISHED_IN]-(paper:paper)\n",
    "            WITH paper, SIZE([(paper)<-[:CITES]-(citing:paper) | citing]) AS citations\n",
    "            ORDER BY citations DESC\n",
    "            LIMIT 100\n",
    "            SET paper:TopPaper\n",
    "            RETURN paper AS TopPaper, citations\n",
    "            \"\"\")\n",
    "            top_papers = [(record[\"TopPaper\"][\"id\"], record[\"citations\"]) for record in result]\n",
    "\n",
    "        for paper_id, citations in top_papers:\n",
    "            print(f\"Top Paper ID: {paper_id} with {citations} citations\")\n",
    "\n",
    "# Usage\n",
    "uri = \"neo4j://localhost:7687\"\n",
    "user = \"neo4j\"\n",
    "password = \"12345678\"\n",
    "paper_finder = toppaper(uri, user, password)\n",
    "paper_finder.find_top_papers()\n",
    "# paper_finder.close()\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "STEP7: Identify Potential Reviewers\n",
    "- Potential reviewers are authors of the top-100 papers. We can find and label these authors using a Cypher query"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "This query:\n",
    "\n",
    "1. Matches authors who have written the top papers.\n",
    "2. Counts the number of top papers each author has written.\n",
    "3. Labels these authors as PotentialReviewer.\n",
    "4. Returns the authors and their contribution counts."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Author: P. Flach with 1 contributions marked as PotentialReviewer\n",
      "Author: José Hernández Orallo with 1 contributions marked as PotentialReviewer\n",
      "Author: C. Ferri with 1 contributions marked as PotentialReviewer\n",
      "Author: Lidia Contreras-Ochando with 1 contributions marked as PotentialReviewer\n",
      "Author: N. Lachiche with 1 contributions marked as PotentialReviewer\n",
      "Author: M. J. R. Quintana with 1 contributions marked as PotentialReviewer\n",
      "Author: Fernando Martínez-Plumed with 1 contributions marked as PotentialReviewer\n",
      "Author: Meelis Kull with 1 contributions marked as PotentialReviewer\n",
      "Author: Iqbal H. Sarker with 1 contributions marked as PotentialReviewer\n",
      "Author: Dakuo Wang with 1 contributions marked as PotentialReviewer\n",
      "Author: Erick Oduor with 1 contributions marked as PotentialReviewer\n",
      "Author: Justin D. Weisz with 1 contributions marked as PotentialReviewer\n",
      "Author: Josh Andres with 1 contributions marked as PotentialReviewer\n",
      "Author: Casey Dugan with 1 contributions marked as PotentialReviewer\n",
      "Author: Cherkeng Heng with 1 contributions marked as PotentialReviewer\n",
      "Author: Marzieh Haghighi with 1 contributions marked as PotentialReviewer\n",
      "Author: B. Cimini with 1 contributions marked as PotentialReviewer\n",
      "Author: A. Goodman with 1 contributions marked as PotentialReviewer\n",
      "Author: Anne E Carpenter with 1 contributions marked as PotentialReviewer\n",
      "Author: Jeanelle Ackerman with 1 contributions marked as PotentialReviewer\n",
      "Author: Juan C. Caicedo with 1 contributions marked as PotentialReviewer\n",
      "Author: M. Rohban with 1 contributions marked as PotentialReviewer\n",
      "Author: Shantanu Singh with 1 contributions marked as PotentialReviewer\n",
      "Author: M. Doan with 1 contributions marked as PotentialReviewer\n",
      "Author: T. Becker with 1 contributions marked as PotentialReviewer\n",
      "Author: Kyle W. Karhohs with 1 contributions marked as PotentialReviewer\n",
      "Author: C. McQuin with 1 contributions marked as PotentialReviewer\n",
      "Author: A. Razi with 1 contributions marked as PotentialReviewer\n",
      "Author: Adrian Weller with 1 contributions marked as PotentialReviewer\n",
      "Author: Junaid Qadir with 1 contributions marked as PotentialReviewer\n",
      "Author: Gareth Tyson with 1 contributions marked as PotentialReviewer\n",
      "Author: J. Crowcroft with 1 contributions marked as PotentialReviewer\n",
      "Author: Waleed Iqbal with 1 contributions marked as PotentialReviewer\n",
      "Author: S. Latif with 1 contributions marked as PotentialReviewer\n",
      "Author: M. Boulos with 1 contributions marked as PotentialReviewer\n",
      "Author: Sanaullah Manzoor with 1 contributions marked as PotentialReviewer\n",
      "Author: Muhammad Usman with 1 contributions marked as PotentialReviewer\n",
      "Author: Ignacio Castro with 1 contributions marked as PotentialReviewer\n",
      "Author: B. Smit with 1 contributions marked as PotentialReviewer\n",
      "Author: K. Jablonka with 1 contributions marked as PotentialReviewer\n",
      "Author: S. M. Moosavi with 1 contributions marked as PotentialReviewer\n",
      "Author: D. Ongari with 1 contributions marked as PotentialReviewer\n",
      "Author: C. Brunsdon with 1 contributions marked as PotentialReviewer\n",
      "Author: A. Comber with 1 contributions marked as PotentialReviewer\n",
      "Author: Dong Liang with 1 contributions marked as PotentialReviewer\n",
      "Author: S. Schade with 1 contributions marked as PotentialReviewer\n",
      "Author: Lizhe Wang with 1 contributions marked as PotentialReviewer\n",
      "Author: M. Craglia with 1 contributions marked as PotentialReviewer\n",
      "Author: M. Pesaresi with 1 contributions marked as PotentialReviewer\n",
      "Author: S. Nativi with 1 contributions marked as PotentialReviewer\n",
      "Author: Zeeshan Shirazi with 1 contributions marked as PotentialReviewer\n",
      "Author: Huadong Guo with 1 contributions marked as PotentialReviewer\n",
      "Author: A. Annoni with 1 contributions marked as PotentialReviewer\n",
      "Author: G. He with 1 contributions marked as PotentialReviewer\n",
      "Author: Jie Liu with 1 contributions marked as PotentialReviewer\n",
      "Author: C. Corbane with 1 contributions marked as PotentialReviewer\n",
      "Author: Jianhui Li with 1 contributions marked as PotentialReviewer\n",
      "Author: P. L. Combettes with 1 contributions marked as PotentialReviewer\n",
      "Author: J. Pesquet with 1 contributions marked as PotentialReviewer\n",
      "Author: S. Speidel with 1 contributions marked as PotentialReviewer\n",
      "Author: H. Kenngott with 1 contributions marked as PotentialReviewer\n",
      "Author: B. Müller-Stich with 1 contributions marked as PotentialReviewer\n",
      "Author: Veith Roethlingshoefer with 1 contributions marked as PotentialReviewer\n",
      "Author: M. Mengler with 1 contributions marked as PotentialReviewer\n",
      "Author: S. Bodenstedt with 1 contributions marked as PotentialReviewer\n",
      "Author: Manuela Capek with 1 contributions marked as PotentialReviewer\n",
      "Author: M. Apitz with 1 contributions marked as PotentialReviewer\n",
      "Author: M. Tizabi with 1 contributions marked as PotentialReviewer\n",
      "Author: Benjamin Müller with 1 contributions marked as PotentialReviewer\n",
      "Author: M. Eisenmann with 1 contributions marked as PotentialReviewer\n",
      "Author: S. Seidlitz with 1 contributions marked as PotentialReviewer\n",
      "Author: M. Wagner with 1 contributions marked as PotentialReviewer\n",
      "Author: Sebastian Bittel with 1 contributions marked as PotentialReviewer\n",
      "Author: Hellena Hempe with 1 contributions marked as PotentialReviewer\n",
      "Author: Tornike Davitashvili with 1 contributions marked as PotentialReviewer\n",
      "Author: Melanie Schellenberg with 1 contributions marked as PotentialReviewer\n",
      "Author: T. Adler with 1 contributions marked as PotentialReviewer\n",
      "Author: Patrick Scholz with 1 contributions marked as PotentialReviewer\n",
      "Author: T. N. Tran with 1 contributions marked as PotentialReviewer\n",
      "Author: D. Filimon with 1 contributions marked as PotentialReviewer\n",
      "Author: Annika Reinke with 1 contributions marked as PotentialReviewer\n",
      "Author: L. Maier-Hein with 1 contributions marked as PotentialReviewer\n",
      "Author: Anna Kisilenko with 1 contributions marked as PotentialReviewer\n",
      "Author: Pierangela Bruno with 1 contributions marked as PotentialReviewer\n",
      "Author: Peter M. Full with 1 contributions marked as PotentialReviewer\n",
      "Author: J. Gröhl with 1 contributions marked as PotentialReviewer\n",
      "Author: Fabian Both with 1 contributions marked as PotentialReviewer\n",
      "Author: T. Ross with 1 contributions marked as PotentialReviewer\n",
      "Author: T. Y. E. Lai with 1 contributions marked as PotentialReviewer\n",
      "Author: Daniel L. Oberski with 1 contributions marked as PotentialReviewer\n",
      "Author: P. Treleaven with 1 contributions marked as PotentialReviewer\n",
      "Author: Zeynep Engin with 1 contributions marked as PotentialReviewer\n",
      "Author: J. Saltz with 1 contributions marked as PotentialReviewer\n",
      "Author: Neil I. Dewar with 1 contributions marked as PotentialReviewer\n",
      "Author: D. Broadhurst with 1 contributions marked as PotentialReviewer\n",
      "Author: Kevin M. Mendez with 1 contributions marked as PotentialReviewer\n",
      "Author: L. Pritchard with 1 contributions marked as PotentialReviewer\n",
      "Author: S. Reinke with 1 contributions marked as PotentialReviewer\n",
      "Author: Alexandre Ribas Semeler with 1 contributions marked as PotentialReviewer\n",
      "Author: Helen Beatriz Frota Rozados with 1 contributions marked as PotentialReviewer\n",
      "Author: Adilson Luiz Pinto with 1 contributions marked as PotentialReviewer\n",
      "Author: B. Healy with 1 contributions marked as PotentialReviewer\n",
      "Author: J. Hsu with 1 contributions marked as PotentialReviewer\n",
      "Author: M. Hernán with 1 contributions marked as PotentialReviewer\n",
      "Author: B. Daniel with 1 contributions marked as PotentialReviewer\n",
      "Author: Daniel Arribas-Bel with 1 contributions marked as PotentialReviewer\n",
      "Author: A. Singleton with 1 contributions marked as PotentialReviewer\n",
      "Author: Sudarshan A. Shetty with 1 contributions marked as PotentialReviewer\n",
      "Author: L. Lahti with 1 contributions marked as PotentialReviewer\n",
      "Author: Donghui Yan with 1 contributions marked as PotentialReviewer\n",
      "Author: Gary E. Davis with 1 contributions marked as PotentialReviewer\n",
      "Author: Rob A. Rutenbar with 1 contributions marked as PotentialReviewer\n",
      "Author: F. Berman with 1 contributions marked as PotentialReviewer\n",
      "Author: S. Davidson with 1 contributions marked as PotentialReviewer\n",
      "Author: Henrik Christensen with 1 contributions marked as PotentialReviewer\n",
      "Author: V. Stodden with 1 contributions marked as PotentialReviewer\n",
      "Author: Michael J. Franklin with 1 contributions marked as PotentialReviewer\n",
      "Author: M. Martonosi with 1 contributions marked as PotentialReviewer\n",
      "Author: D. Estrin with 1 contributions marked as PotentialReviewer\n",
      "Author: A. Szalay with 1 contributions marked as PotentialReviewer\n",
      "Author: B. Hailpern with 1 contributions marked as PotentialReviewer\n",
      "Author: Padma Raghavan with 1 contributions marked as PotentialReviewer\n",
      "Author: B. Hickson with 1 contributions marked as PotentialReviewer\n",
      "Author: Chris Kollen with 1 contributions marked as PotentialReviewer\n",
      "Author: J. Oliver with 1 contributions marked as PotentialReviewer\n",
      "Author: F. Rios with 1 contributions marked as PotentialReviewer\n",
      "Author: Tim Kraska with 1 contributions marked as PotentialReviewer\n",
      "Author: N. Samatova with 1 contributions marked as PotentialReviewer\n",
      "Author: S. Shekhar with 1 contributions marked as PotentialReviewer\n",
      "Author: Vipin Kumar with 1 contributions marked as PotentialReviewer\n",
      "Author: James H. Faghmous with 1 contributions marked as PotentialReviewer\n",
      "Author: G. Atluri with 1 contributions marked as PotentialReviewer\n",
      "Author: A. Karpatne with 1 contributions marked as PotentialReviewer\n",
      "Author: A. Ganguly with 1 contributions marked as PotentialReviewer\n",
      "Author: A. Banerjee with 1 contributions marked as PotentialReviewer\n",
      "Author: M. Steinbach with 1 contributions marked as PotentialReviewer\n",
      "Author: C. Weihs with 1 contributions marked as PotentialReviewer\n",
      "Author: K. Ickstadt with 1 contributions marked as PotentialReviewer\n",
      "Author: Longbing Cao with 1 contributions marked as PotentialReviewer\n",
      "Author: P. Runeson with 2 contributions marked as PotentialReviewer\n",
      "Author: Martin Höst with 2 contributions marked as PotentialReviewer\n",
      "Author: E. Foster with 1 contributions marked as PotentialReviewer\n",
      "Author: S. Linkman with 1 contributions marked as PotentialReviewer\n",
      "Author: P. Brereton with 3 contributions marked as PotentialReviewer\n",
      "Author: M. Turner with 1 contributions marked as PotentialReviewer\n",
      "Author: J. Bailey with 1 contributions marked as PotentialReviewer\n",
      "Author: D. Budgen with 2 contributions marked as PotentialReviewer\n",
      "Author: B. Kitchenham with 3 contributions marked as PotentialReviewer\n",
      "Author: T. Gorschek with 1 contributions marked as PotentialReviewer\n",
      "Author: M. Unterkalmsteiner with 1 contributions marked as PotentialReviewer\n",
      "Author: E. Klotins with 1 contributions marked as PotentialReviewer\n",
      "Author: Jürgen Münch with 1 contributions marked as PotentialReviewer\n",
      "Author: D. Falessi with 1 contributions marked as PotentialReviewer\n",
      "Author: Andreas Jedlitschka with 1 contributions marked as PotentialReviewer\n",
      "Author: C. Wohlin with 1 contributions marked as PotentialReviewer\n",
      "Author: Burak Turhan with 1 contributions marked as PotentialReviewer\n",
      "Author: Natalia Juristo Juzgado with 1 contributions marked as PotentialReviewer\n",
      "Author: M. Oivo with 1 contributions marked as PotentialReviewer\n",
      "Author: B. Fitzgerald with 1 contributions marked as PotentialReviewer\n",
      "Author: Klaas-Jan Stol with 1 contributions marked as PotentialReviewer\n",
      "Author: Subhajit Datta with 1 contributions marked as PotentialReviewer\n",
      "Author: Proshanta Sarkar with 1 contributions marked as PotentialReviewer\n",
      "Author: R. Jongeling with 1 contributions marked as PotentialReviewer\n",
      "Author: Alexander Serebrenik with 1 contributions marked as PotentialReviewer\n",
      "Author: Brice Morin with 1 contributions marked as PotentialReviewer\n",
      "Author: Nicolas Harrand with 1 contributions marked as PotentialReviewer\n",
      "Author: F. Fleurey with 1 contributions marked as PotentialReviewer\n",
      "Author: F. Zambonelli with 1 contributions marked as PotentialReviewer\n",
      "Author: Thomas D. LaToza with 2 contributions marked as PotentialReviewer\n",
      "Author: A. Hoek with 1 contributions marked as PotentialReviewer\n",
      "Author: M. Kuhrmann with 1 contributions marked as PotentialReviewer\n",
      "Author: D. M. Fernández with 1 contributions marked as PotentialReviewer\n",
      "Author: M. Daneva with 1 contributions marked as PotentialReviewer\n",
      "Author: J. Bosch with 1 contributions marked as PotentialReviewer\n",
      "Author: M. O. Cinnéide with 1 contributions marked as PotentialReviewer\n",
      "Author: Mohamed Wiem Mkaouer with 1 contributions marked as PotentialReviewer\n",
      "Author: M. Kessentini with 1 contributions marked as PotentialReviewer\n",
      "Author: Slim Bechikh with 1 contributions marked as PotentialReviewer\n",
      "Author: K. Deb with 1 contributions marked as PotentialReviewer\n",
      "Author: C. D. Souza with 1 contributions marked as PotentialReviewer\n",
      "Author: Y. Dittrich with 1 contributions marked as PotentialReviewer\n",
      "Author: H. Sharp with 1 contributions marked as PotentialReviewer\n",
      "Author: M. Burnett with 1 contributions marked as PotentialReviewer\n",
      "Author: Amy J. Ko with 1 contributions marked as PotentialReviewer\n",
      "Author: D. Moody with 1 contributions marked as PotentialReviewer\n",
      "Author: A. Rainer with 1 contributions marked as PotentialReviewer\n",
      "Author: B. Regnell with 1 contributions marked as PotentialReviewer\n",
      "Author: S. Apel with 1 contributions marked as PotentialReviewer\n",
      "Author: J. Siegmund with 1 contributions marked as PotentialReviewer\n",
      "Author: Norbert Siegmund with 1 contributions marked as PotentialReviewer\n",
      "Author: Soo Ling Lim with 1 contributions marked as PotentialReviewer\n",
      "Author: S. Honiden with 1 contributions marked as PotentialReviewer\n",
      "Author: F. Ishikawa with 1 contributions marked as PotentialReviewer\n",
      "Author: P. Bentley with 1 contributions marked as PotentialReviewer\n",
      "Author: N. Kanakam with 1 contributions marked as PotentialReviewer\n",
      "Author: L. G. Wallgren with 1 contributions marked as PotentialReviewer\n",
      "Author: R. Feldt with 1 contributions marked as PotentialReviewer\n",
      "Author: Per Lenberg with 1 contributions marked as PotentialReviewer\n",
      "Author: D. Mandrioli with 1 contributions marked as PotentialReviewer\n",
      "Author: M. Jazayeri with 1 contributions marked as PotentialReviewer\n",
      "Author: C. Ghezzi with 1 contributions marked as PotentialReviewer\n",
      "Author: C. Calero with 1 contributions marked as PotentialReviewer\n",
      "Author: M. Piattini with 1 contributions marked as PotentialReviewer\n",
      "Author: K. Pohl with 1 contributions marked as PotentialReviewer\n",
      "Author: F. V. Linden with 1 contributions marked as PotentialReviewer\n",
      "Author: Günter Böckle with 1 contributions marked as PotentialReviewer\n",
      "Author: Lukas Zimmermann with 1 contributions marked as PotentialReviewer\n",
      "Author: V. Alva with 1 contributions marked as PotentialReviewer\n",
      "Author: J. Söding with 1 contributions marked as PotentialReviewer\n",
      "Author: Andrew Stephens with 1 contributions marked as PotentialReviewer\n",
      "Author: Seung-Zin Nam with 1 contributions marked as PotentialReviewer\n",
      "Author: A. Lupas with 1 contributions marked as PotentialReviewer\n",
      "Author: Marko Lozajic with 1 contributions marked as PotentialReviewer\n",
      "Author: Felix Gabler with 1 contributions marked as PotentialReviewer\n",
      "Author: Jonas M. Kübler with 1 contributions marked as PotentialReviewer\n",
      "Author: David Rau with 1 contributions marked as PotentialReviewer\n",
      "Author: Myong-Soon Park with 1 contributions marked as PotentialReviewer\n",
      "Author: A. Bashir with 1 contributions marked as PotentialReviewer\n",
      "Author: S. C. Shah with 1 contributions marked as PotentialReviewer\n",
      "Author: Sajjad Hussain with 1 contributions marked as PotentialReviewer\n",
      "Author: Wan-Sik Choi with 1 contributions marked as PotentialReviewer\n",
      "Author: Thomas A. Geddes with 1 contributions marked as PotentialReviewer\n",
      "Author: Yue Cao with 1 contributions marked as PotentialReviewer\n",
      "Author: Pengyi Yang with 1 contributions marked as PotentialReviewer\n",
      "Author: J. Yang with 1 contributions marked as PotentialReviewer\n",
      "Author: J. Davis with 1 contributions marked as PotentialReviewer\n",
      "Author: Jüergen Cox with 1 contributions marked as PotentialReviewer\n",
      "Author: S. Tyanova with 1 contributions marked as PotentialReviewer\n",
      "Author: Kevin Glover with 1 contributions marked as PotentialReviewer\n",
      "Author: Matthew R. Pocock with 1 contributions marked as PotentialReviewer\n",
      "Author: Justin Ferris with 1 contributions marked as PotentialReviewer\n",
      "Author: T. Oinn with 1 contributions marked as PotentialReviewer\n",
      "Author: Robert Mark Greenwood with 1 contributions marked as PotentialReviewer\n",
      "Author: M. Addis with 1 contributions marked as PotentialReviewer\n",
      "Author: A. Wipat with 1 contributions marked as PotentialReviewer\n",
      "Author: D. Marvin with 1 contributions marked as PotentialReviewer\n",
      "Author: M. Senger with 1 contributions marked as PotentialReviewer\n",
      "Author: Peter Li with 1 contributions marked as PotentialReviewer\n",
      "Author: T. Carver with 1 contributions marked as PotentialReviewer\n",
      "Author: S. Pollett with 1 contributions marked as PotentialReviewer\n",
      "Author: W. Rutvisuttinunt with 1 contributions marked as PotentialReviewer\n",
      "Author: R. Jarman with 1 contributions marked as PotentialReviewer\n",
      "Author: Eldin Talundzic with 1 contributions marked as PotentialReviewer\n",
      "Author: Lindsay C Morton with 1 contributions marked as PotentialReviewer\n",
      "Author: K. Bishop-Lilly with 1 contributions marked as PotentialReviewer\n",
      "Author: I. Maljkovic Berry with 1 contributions marked as PotentialReviewer\n",
      "Author: M. Melendrez with 1 contributions marked as PotentialReviewer\n",
      "Author: Wenfu Dong with 1 contributions marked as PotentialReviewer\n",
      "Author: L. Tang with 1 contributions marked as PotentialReviewer\n",
      "Author: Wei Zhou with 1 contributions marked as PotentialReviewer\n",
      "Author: Shaowen Yao with 1 contributions marked as PotentialReviewer\n",
      "Author: Lin Liu with 1 contributions marked as PotentialReviewer\n",
      "Author: K. Lauter with 1 contributions marked as PotentialReviewer\n",
      "Author: Ran Gilad-Bachrach with 1 contributions marked as PotentialReviewer\n",
      "Author: Nathan Dowlin with 1 contributions marked as PotentialReviewer\n",
      "Author: M. Naehrig with 1 contributions marked as PotentialReviewer\n",
      "Author: J. Wernsing with 1 contributions marked as PotentialReviewer\n",
      "Author: Kim Laine with 1 contributions marked as PotentialReviewer\n",
      "Author: A. Rosenwald with 1 contributions marked as PotentialReviewer\n",
      "Author: B. Gaëta with 1 contributions marked as PotentialReviewer\n",
      "Author: S. Morgan with 1 contributions marked as PotentialReviewer\n",
      "Author: G. Rustici with 1 contributions marked as PotentialReviewer\n",
      "Author: Michelle D. Brazas with 1 contributions marked as PotentialReviewer\n",
      "Author: M. Pauley with 1 contributions marked as PotentialReviewer\n",
      "Author: N. Mulder with 2 contributions marked as PotentialReviewer\n",
      "Author: L. Welch with 1 contributions marked as PotentialReviewer\n",
      "Author: R. Schwartz with 1 contributions marked as PotentialReviewer\n",
      "Author: C. Brooksbank with 1 contributions marked as PotentialReviewer\n",
      "Author: T. Warnow with 1 contributions marked as PotentialReviewer\n",
      "Author: M. Sierk with 1 contributions marked as PotentialReviewer\n",
      "Author: M. Rossi with 1 contributions marked as PotentialReviewer\n",
      "Author: G. Van Domselaar with 1 contributions marked as PotentialReviewer\n",
      "Author: J. Moran-Gilad with 1 contributions marked as PotentialReviewer\n",
      "Author: João André Carriço with 1 contributions marked as PotentialReviewer\n",
      "Author: M. Ramirez with 1 contributions marked as PotentialReviewer\n",
      "Author: L. S. Mainzer with 1 contributions marked as PotentialReviewer\n",
      "Author: Ayton Meintjes with 1 contributions marked as PotentialReviewer\n",
      "Author: Sumir Panji with 1 contributions marked as PotentialReviewer\n",
      "Author: M. Crusoe with 1 contributions marked as PotentialReviewer\n",
      "Author: S. Aron with 1 contributions marked as PotentialReviewer\n",
      "Author: Hocine Bendou with 1 contributions marked as PotentialReviewer\n",
      "Author: F. Joubert with 1 contributions marked as PotentialReviewer\n",
      "Author: Azza E. Ahmed with 1 contributions marked as PotentialReviewer\n",
      "Author: S. Hazelhurst with 1 contributions marked as PotentialReviewer\n",
      "Author: Eugene de Beste with 1 contributions marked as PotentialReviewer\n",
      "Author: G. Botha with 1 contributions marked as PotentialReviewer\n",
      "Author: Yassine Souilmi with 1 contributions marked as PotentialReviewer\n",
      "Author: Lerato E. Magosi with 1 contributions marked as PotentialReviewer\n",
      "Author: Faisal M. Fadlelmola with 1 contributions marked as PotentialReviewer\n",
      "Author: C. Jongeneel with 1 contributions marked as PotentialReviewer\n",
      "Author: Mustafa Alghali with 1 contributions marked as PotentialReviewer\n",
      "Author: P. T. Mpangase with 1 contributions marked as PotentialReviewer\n",
      "Author: S. Baichoo with 1 contributions marked as PotentialReviewer\n",
      "Author: D. Armstrong with 1 contributions marked as PotentialReviewer\n",
      "Author: Long Yi with 1 contributions marked as PotentialReviewer\n",
      "Author: M. Mbiyavanga with 1 contributions marked as PotentialReviewer\n",
      "Author: P. Heusden with 1 contributions marked as PotentialReviewer\n",
      "Author: Jennie Zermeno with 1 contributions marked as PotentialReviewer\n",
      "Author: Brian D. O'Connor with 1 contributions marked as PotentialReviewer\n",
      "Author: Oussema Souiai with 1 contributions marked as PotentialReviewer\n",
      "Author: Graeme Benstead-Hume with 1 contributions marked as PotentialReviewer\n",
      "Author: Y. Ali with 1 contributions marked as PotentialReviewer\n",
      "Author: F. Pearl with 1 contributions marked as PotentialReviewer\n",
      "Author: Sarah K. Wooller with 1 contributions marked as PotentialReviewer\n",
      "Author: Xiangrong Chen with 1 contributions marked as PotentialReviewer\n",
      "Author: Nathaniel J. Serpico with 1 contributions marked as PotentialReviewer\n",
      "Author: P. Trainor with 1 contributions marked as PotentialReviewer\n",
      "Author: B. Daigle with 2 contributions marked as PotentialReviewer\n",
      "Author: Kazi I. Zaman with 1 contributions marked as PotentialReviewer\n",
      "Author: R. Homayouni with 1 contributions marked as PotentialReviewer\n",
      "Author: Y. Cui with 1 contributions marked as PotentialReviewer\n",
      "Author: H. Moseley with 2 contributions marked as PotentialReviewer\n",
      "Author: Shreedharkumar D. Rajurkar with 1 contributions marked as PotentialReviewer\n",
      "Author: Hao Chen with 1 contributions marked as PotentialReviewer\n",
      "Author: J. Park with 1 contributions marked as PotentialReviewer\n",
      "Author: M. Farman with 2 contributions marked as PotentialReviewer\n",
      "Author: Joshua M. Mitchell with 1 contributions marked as PotentialReviewer\n",
      "Author: Jolanta Jaromczyk with 1 contributions marked as PotentialReviewer\n",
      "Author: Vikas Singh with 1 contributions marked as PotentialReviewer\n",
      "Author: N. Moore with 2 contributions marked as PotentialReviewer\n",
      "Author: Bailey K. Phan with 1 contributions marked as PotentialReviewer\n",
      "Author: J. Chariker with 1 contributions marked as PotentialReviewer\n",
      "Author: J. Jaromczyk with 2 contributions marked as PotentialReviewer\n",
      "Author: Andrey Smelter with 1 contributions marked as PotentialReviewer\n",
      "Author: Li Chen with 1 contributions marked as PotentialReviewer\n",
      "Author: R. Flight with 1 contributions marked as PotentialReviewer\n",
      "Author: Eun Kyong Shin with 1 contributions marked as PotentialReviewer\n",
      "Author: Caroline Melton with 1 contributions marked as PotentialReviewer\n",
      "Author: A. Lane with 1 contributions marked as PotentialReviewer\n",
      "Author: Liangqun Lu with 1 contributions marked as PotentialReviewer\n",
      "Author: P. Calie with 1 contributions marked as PotentialReviewer\n",
      "Author: J. Mandel with 1 contributions marked as PotentialReviewer\n",
      "Author: E. Rouchka with 1 contributions marked as PotentialReviewer\n",
      "Author: R. Higashi with 1 contributions marked as PotentialReviewer\n",
      "Author: Qing Jun Wang with 1 contributions marked as PotentialReviewer\n",
      "Author: Arash Shaban-Nejad with 1 contributions marked as PotentialReviewer\n",
      "Author: R. Davis with 1 contributions marked as PotentialReviewer\n",
      "Author: Ethan G. Toney with 1 contributions marked as PotentialReviewer\n",
      "Author: Xi Chen with 1 contributions marked as PotentialReviewer\n",
      "Author: Bradford Condon with 1 contributions marked as PotentialReviewer\n",
      "Author: A. DeFilippis with 1 contributions marked as PotentialReviewer\n",
      "Author: N. Verma with 1 contributions marked as PotentialReviewer\n",
      "Author: Samantha M. Carlisle with 1 contributions marked as PotentialReviewer\n",
      "Author: D. Tieri with 1 contributions marked as PotentialReviewer\n",
      "Author: Daniel R. Harris with 1 contributions marked as PotentialReviewer\n",
      "Author: S. Rai with 1 contributions marked as PotentialReviewer\n",
      "Author: T. Fan with 1 contributions marked as PotentialReviewer\n",
      "Author: S. Hart with 1 contributions marked as PotentialReviewer\n",
      "Author: Gavin R. Oliver with 1 contributions marked as PotentialReviewer\n",
      "Author: E. Klee with 1 contributions marked as PotentialReviewer\n",
      "Author: I. Jurisica with 1 contributions marked as PotentialReviewer\n",
      "Author: M. Dehmer with 1 contributions marked as PotentialReviewer\n",
      "Author: Andreas Holzinger with 1 contributions marked as PotentialReviewer\n",
      "Author: K. Fraughnaugh with 1 contributions marked as PotentialReviewer\n",
      "Author: N. Lighthall with 1 contributions marked as PotentialReviewer\n",
      "Author: W. Karwowski with 1 contributions marked as PotentialReviewer\n",
      "Author: F. Farahani with 1 contributions marked as PotentialReviewer\n",
      "Author: M. Yavari with 1 contributions marked as PotentialReviewer\n",
      "Author: Prahalada K. Rao with 1 contributions marked as PotentialReviewer\n",
      "Author: K. Cole with 1 contributions marked as PotentialReviewer\n",
      "Author: Ting Zhang with 1 contributions marked as PotentialReviewer\n",
      "Author: De-gan Zhang with 1 contributions marked as PotentialReviewer\n",
      "Author: Xiao-huan Liu with 1 contributions marked as PotentialReviewer\n",
      "Author: Jinghong Gao with 1 contributions marked as PotentialReviewer\n",
      "Author: Yu-ya Cui with 1 contributions marked as PotentialReviewer\n",
      "Author: Ya-meng Tang with 1 contributions marked as PotentialReviewer\n",
      "Author: H. Adeli with 1 contributions marked as PotentialReviewer\n",
      "Author: Jon del'Etoile with 1 contributions marked as PotentialReviewer\n",
      "Author: Xiaojian Li with 1 contributions marked as PotentialReviewer\n",
      "Author: Guanghong Yang with 1 contributions marked as PotentialReviewer\n",
      "Author: M. Aroyo with 1 contributions marked as PotentialReviewer\n",
      "Author: B. Bradlyn with 1 contributions marked as PotentialReviewer\n",
      "Author: C. Felser with 1 contributions marked as PotentialReviewer\n",
      "Author: L. Elcoro with 1 contributions marked as PotentialReviewer\n",
      "Author: B. Bernevig with 1 contributions marked as PotentialReviewer\n",
      "Author: Jennifer Cano with 1 contributions marked as PotentialReviewer\n",
      "Author: M. G. Vergniory with 1 contributions marked as PotentialReviewer\n",
      "Author: Zhijun Wang with 1 contributions marked as PotentialReviewer\n",
      "Author: M. Dale with 1 contributions marked as PotentialReviewer\n",
      "Author: D. Stahlke with 1 contributions marked as PotentialReviewer\n",
      "Author: Josh Tobin with 1 contributions marked as PotentialReviewer\n",
      "Author: Michael Tait with 1 contributions marked as PotentialReviewer\n",
      "Author: M. Sperling with 1 contributions marked as PotentialReviewer\n",
      "Author: R. Rider with 1 contributions marked as PotentialReviewer\n",
      "Author: C. Skidmore with 1 contributions marked as PotentialReviewer\n",
      "Author: J. Tracy with 1 contributions marked as PotentialReviewer\n",
      "Author: Nathan Taylor with 1 contributions marked as PotentialReviewer\n",
      "Author: A. Sharan with 1 contributions marked as PotentialReviewer\n",
      "Author: G. Doucet with 1 contributions marked as PotentialReviewer\n",
      "Author: M. Broom with 1 contributions marked as PotentialReviewer\n",
      "Author: J. Rychtář with 1 contributions marked as PotentialReviewer\n",
      "Author: K. Pattni with 1 contributions marked as PotentialReviewer\n",
      "Author: L. Silvers with 1 contributions marked as PotentialReviewer\n",
      "Author: D. Holtzman with 1 contributions marked as PotentialReviewer\n",
      "Author: J. Morris with 1 contributions marked as PotentialReviewer\n",
      "Author: M. Brier with 1 contributions marked as PotentialReviewer\n",
      "Author: J. Hassenstab with 1 contributions marked as PotentialReviewer\n",
      "Author: B. Ances with 1 contributions marked as PotentialReviewer\n",
      "Author: Jewell B. Thomas with 1 contributions marked as PotentialReviewer\n",
      "Author: T. Benzinger with 1 contributions marked as PotentialReviewer\n",
      "Author: A. Fagan with 1 contributions marked as PotentialReviewer\n",
      "Author: Sarah Rothstein with 1 contributions marked as PotentialReviewer\n",
      "Author: A. Dubis with 1 contributions marked as PotentialReviewer\n",
      "Author: S. Chiu with 2 contributions marked as PotentialReviewer\n",
      "Author: J. Izatt with 2 contributions marked as PotentialReviewer\n",
      "Author: Sina Farsiu with 2 contributions marked as PotentialReviewer\n",
      "Author: Y. Lokhnygina with 1 contributions marked as PotentialReviewer\n",
      "Author: J. Carroll with 1 contributions marked as PotentialReviewer\n",
      "Author: A. Dubra with 1 contributions marked as PotentialReviewer\n",
      "Author: E. Bullmore with 1 contributions marked as PotentialReviewer\n",
      "Author: O. Sporns with 1 contributions marked as PotentialReviewer\n",
      "Author: Ryan P. McNabb with 1 contributions marked as PotentialReviewer\n",
      "Author: F. Larocca with 1 contributions marked as PotentialReviewer\n",
      "Author: A. Kuo with 1 contributions marked as PotentialReviewer\n",
      "Author: P. Potočnik with 1 contributions marked as PotentialReviewer\n",
      "Author: D. Archdeacon with 1 contributions marked as PotentialReviewer\n",
      "Author: A. Vince with 1 contributions marked as PotentialReviewer\n",
      "Author: A. White with 1 contributions marked as PotentialReviewer\n",
      "Author: T. Tucker with 1 contributions marked as PotentialReviewer\n",
      "Author: T. Pisanski with 1 contributions marked as PotentialReviewer\n",
      "Author: J. Gross with 1 contributions marked as PotentialReviewer\n",
      "Author: Seiya Negami with 1 contributions marked as PotentialReviewer\n",
      "Author: Jianer Chen with 1 contributions marked as PotentialReviewer\n",
      "Author: A. Canutescu with 1 contributions marked as PotentialReviewer\n",
      "Author: Roland L. Dunbrack with 1 contributions marked as PotentialReviewer\n",
      "Author: A. Shelenkov with 1 contributions marked as PotentialReviewer\n",
      "Author: A. Oliva with 1 contributions marked as PotentialReviewer\n",
      "Author: A. Khosla with 1 contributions marked as PotentialReviewer\n",
      "Author: Bolei Zhou with 1 contributions marked as PotentialReviewer\n",
      "Author: À. Lapedriza with 1 contributions marked as PotentialReviewer\n",
      "Author: A. Torralba with 2 contributions marked as PotentialReviewer\n",
      "Author: H. Hermjakob with 1 contributions marked as PotentialReviewer\n",
      "Author: José A. Dianes with 1 contributions marked as PotentialReviewer\n",
      "Author: Yasset Pérez-Riverol with 1 contributions marked as PotentialReviewer\n",
      "Author: Gerhard Mayer with 1 contributions marked as PotentialReviewer\n",
      "Author: Ilias Lavidas with 1 contributions marked as PotentialReviewer\n",
      "Author: J. Vizcaíno with 1 contributions marked as PotentialReviewer\n",
      "Author: Qing-Wei Xu with 1 contributions marked as PotentialReviewer\n",
      "Author: N. del-Toro with 1 contributions marked as PotentialReviewer\n",
      "Author: Tobias Ternent with 1 contributions marked as PotentialReviewer\n",
      "Author: A. Csordas with 1 contributions marked as PotentialReviewer\n",
      "Author: J. Griss with 1 contributions marked as PotentialReviewer\n",
      "Author: F. Reisinger with 1 contributions marked as PotentialReviewer\n",
      "Author: Rui Wang with 1 contributions marked as PotentialReviewer\n",
      "Author: Eoin L. Brodie with 1 contributions marked as PotentialReviewer\n",
      "Author: M. Rojas with 1 contributions marked as PotentialReviewer\n",
      "Author: G. Andersen with 1 contributions marked as PotentialReviewer\n",
      "Author: T. Huber with 1 contributions marked as PotentialReviewer\n",
      "Author: P. Hu with 1 contributions marked as PotentialReviewer\n",
      "Author: P. Hugenholtz with 1 contributions marked as PotentialReviewer\n",
      "Author: T. DeSantis with 1 contributions marked as PotentialReviewer\n",
      "Author: N. Larsen with 1 contributions marked as PotentialReviewer\n",
      "Author: K. Keller with 1 contributions marked as PotentialReviewer\n",
      "Author: D. Dalevi with 1 contributions marked as PotentialReviewer\n",
      "Author: W. Hsiao with 1 contributions marked as PotentialReviewer\n",
      "Author: Tammy T. Y. Lau with 1 contributions marked as PotentialReviewer\n",
      "Author: W. Huynh with 1 contributions marked as PotentialReviewer\n",
      "Author: A. McArthur with 1 contributions marked as PotentialReviewer\n",
      "Author: Sally Y Min with 1 contributions marked as PotentialReviewer\n",
      "Author: A. Miroshnichenko with 1 contributions marked as PotentialReviewer\n",
      "Author: Andrew C. Pawlowski with 1 contributions marked as PotentialReviewer\n",
      "Author: Annie A. Cheng with 1 contributions marked as PotentialReviewer\n",
      "Author: F. Brinkman with 1 contributions marked as PotentialReviewer\n",
      "Author: Martins Oloni with 1 contributions marked as PotentialReviewer\n",
      "Author: Arman Edalatmand with 1 contributions marked as PotentialReviewer\n",
      "Author: M. Faltyn with 1 contributions marked as PotentialReviewer\n",
      "Author: Arjun N. Sharma with 1 contributions marked as PotentialReviewer\n",
      "Author: R. Werfalli with 1 contributions marked as PotentialReviewer\n",
      "Author: Haley L. Zubyk with 1 contributions marked as PotentialReviewer\n",
      "Author: Anastasia Hernández-Koutoucheva with 1 contributions marked as PotentialReviewer\n",
      "Author: G. Domselaar with 1 contributions marked as PotentialReviewer\n",
      "Author: F. Maguire with 1 contributions marked as PotentialReviewer\n",
      "Author: E. Griffiths with 1 contributions marked as PotentialReviewer\n",
      "Author: G. Winsor with 1 contributions marked as PotentialReviewer\n",
      "Author: Sihan Liu with 1 contributions marked as PotentialReviewer\n",
      "Author: Damion M. Dooley with 1 contributions marked as PotentialReviewer\n",
      "Author: E. Bordeleau with 1 contributions marked as PotentialReviewer\n",
      "Author: Bhavya Singh with 1 contributions marked as PotentialReviewer\n",
      "Author: Anna-Lisa V. Nguyen with 1 contributions marked as PotentialReviewer\n",
      "Author: Amogelang R. Raphenya with 1 contributions marked as PotentialReviewer\n",
      "Author: Mégane Bouchard with 1 contributions marked as PotentialReviewer\n",
      "Author: Kara K. Tsang with 1 contributions marked as PotentialReviewer\n",
      "Author: Brian P. Alcock with 1 contributions marked as PotentialReviewer\n",
      "Author: R. Beiko with 1 contributions marked as PotentialReviewer\n",
      "Author: Jalees A. Nasir with 1 contributions marked as PotentialReviewer\n",
      "Author: Alexandra Florescu with 1 contributions marked as PotentialReviewer\n",
      "Author: D. Speicher with 1 contributions marked as PotentialReviewer\n",
      "Author: Hiu-Ki Tran with 1 contributions marked as PotentialReviewer\n",
      "Author: Yann LeCun with 1 contributions marked as PotentialReviewer\n",
      "Author: Corinna Cortes with 1 contributions marked as PotentialReviewer\n",
      "Author: E. Koonin with 1 contributions marked as PotentialReviewer\n",
      "Author: J. Jackson with 1 contributions marked as PotentialReviewer\n",
      "Author: B. Kiryutin with 1 contributions marked as PotentialReviewer\n",
      "Author: J. Yin with 1 contributions marked as PotentialReviewer\n",
      "Author: S. Mekhedov with 1 contributions marked as PotentialReviewer\n",
      "Author: A. Sverdlov with 1 contributions marked as PotentialReviewer\n",
      "Author: D. M. Krylov with 1 contributions marked as PotentialReviewer\n",
      "Author: D. Natale with 1 contributions marked as PotentialReviewer\n",
      "Author: B. S. Rao with 1 contributions marked as PotentialReviewer\n",
      "Author: A. Nikolskaya with 1 contributions marked as PotentialReviewer\n",
      "Author: S. Smirnov with 1 contributions marked as PotentialReviewer\n",
      "Author: R. Mazumder with 1 contributions marked as PotentialReviewer\n",
      "Author: S. Vasudevan with 1 contributions marked as PotentialReviewer\n",
      "Author: N. Fedorova with 1 contributions marked as PotentialReviewer\n",
      "Author: Y. Wolf with 1 contributions marked as PotentialReviewer\n",
      "Author: A. R. Jacobs with 1 contributions marked as PotentialReviewer\n",
      "Author: R. Tatusov with 1 contributions marked as PotentialReviewer\n",
      "Author: Jinan Wang with 1 contributions marked as PotentialReviewer\n",
      "Author: Jinlong Ru with 1 contributions marked as PotentialReviewer\n",
      "Author: Peng Li with 1 contributions marked as PotentialReviewer\n",
      "Author: W. Zhou with 1 contributions marked as PotentialReviewer\n",
      "Author: Chao Huang with 1 contributions marked as PotentialReviewer\n",
      "Author: Pidong Li with 1 contributions marked as PotentialReviewer\n",
      "Author: Zihu Guo with 1 contributions marked as PotentialReviewer\n",
      "Author: Yonghua Wang with 1 contributions marked as PotentialReviewer\n",
      "Author: Xue Xu with 1 contributions marked as PotentialReviewer\n",
      "Author: Yan Li with 1 contributions marked as PotentialReviewer\n",
      "Author: W. Tao with 1 contributions marked as PotentialReviewer\n",
      "Author: Bohui Li with 1 contributions marked as PotentialReviewer\n",
      "Author: Ling Yang with 1 contributions marked as PotentialReviewer\n",
      "Author: Yinfeng Yang with 1 contributions marked as PotentialReviewer\n",
      "Author: W. Freeman with 1 contributions marked as PotentialReviewer\n",
      "Author: K. Murphy with 1 contributions marked as PotentialReviewer\n",
      "Author: Bryan C. Russell with 1 contributions marked as PotentialReviewer\n",
      "Author: M. Soleymani with 1 contributions marked as PotentialReviewer\n",
      "Author: Sander Koelstra with 1 contributions marked as PotentialReviewer\n",
      "Author: I. Patras with 1 contributions marked as PotentialReviewer\n",
      "Author: A. Nijholt with 1 contributions marked as PotentialReviewer\n",
      "Author: T. Ebrahimi with 1 contributions marked as PotentialReviewer\n",
      "Author: Jong-Seok Lee with 1 contributions marked as PotentialReviewer\n",
      "Author: A. Yazdani with 1 contributions marked as PotentialReviewer\n",
      "Author: T. Pun with 1 contributions marked as PotentialReviewer\n",
      "Author: C. Mühl with 1 contributions marked as PotentialReviewer\n",
      "Author: G. Clarke with 1 contributions marked as PotentialReviewer\n",
      "Author: Patrick Paul Walsh with 1 contributions marked as PotentialReviewer\n",
      "Author: Alberto Groff with 1 contributions marked as PotentialReviewer\n",
      "Author: T. Beck with 1 contributions marked as PotentialReviewer\n",
      "Author: P. Keefer with 1 contributions marked as PotentialReviewer\n",
      "Author: L. Celi with 1 contributions marked as PotentialReviewer\n",
      "Author: O. Badawi with 1 contributions marked as PotentialReviewer\n",
      "Author: J. Raffa with 1 contributions marked as PotentialReviewer\n",
      "Author: A. Johnson with 1 contributions marked as PotentialReviewer\n",
      "Author: R. Mark with 1 contributions marked as PotentialReviewer\n",
      "Author: T. Pollard with 1 contributions marked as PotentialReviewer\n",
      "Author: H. Wechsler with 1 contributions marked as PotentialReviewer\n",
      "Author: P. Phillips with 1 contributions marked as PotentialReviewer\n",
      "Author: Patrick J. Rauss with 1 contributions marked as PotentialReviewer\n",
      "Author: Jeffrey R. Huang with 1 contributions marked as PotentialReviewer\n",
      "Author: Shrikanth S. Narayanan with 1 contributions marked as PotentialReviewer\n",
      "Author: Sungbok Lee with 1 contributions marked as PotentialReviewer\n",
      "Author: Chi-Chun Lee with 1 contributions marked as PotentialReviewer\n",
      "Author: Ebrahim (Abe) Kazemzadeh with 1 contributions marked as PotentialReviewer\n",
      "Author: M. Bulut with 1 contributions marked as PotentialReviewer\n",
      "Author: C. Busso with 1 contributions marked as PotentialReviewer\n",
      "Author: Jeannette N. Chang with 1 contributions marked as PotentialReviewer\n",
      "Author: E. Provost with 1 contributions marked as PotentialReviewer\n",
      "Author: Samuel Kim with 1 contributions marked as PotentialReviewer\n",
      "Author: K. Egiazarian with 1 contributions marked as PotentialReviewer\n",
      "Author: J. Astola with 1 contributions marked as PotentialReviewer\n",
      "Author: F. Battisti with 1 contributions marked as PotentialReviewer\n",
      "Author: N. Ponomarenko with 1 contributions marked as PotentialReviewer\n",
      "Author: C.-C. Jay Kuo with 1 contributions marked as PotentialReviewer\n",
      "Author: V. Lukin with 1 contributions marked as PotentialReviewer\n",
      "Author: O. Ieremeiev with 1 contributions marked as PotentialReviewer\n",
      "Author: B. Vozel with 1 contributions marked as PotentialReviewer\n",
      "Author: M. Carli with 1 contributions marked as PotentialReviewer\n",
      "Author: K. Chehdi with 1 contributions marked as PotentialReviewer\n",
      "Author: Lina Jin with 1 contributions marked as PotentialReviewer\n"
     ]
    }
   ],
   "source": [
    "def find_potential_reviewers(self):\n",
    "    with self.driver.session() as session:\n",
    "        reviewers = session.execute_write(self._find_and_label_potential_reviewers)\n",
    "        for reviewer in reviewers:\n",
    "            print(f\"Author: {reviewer['Author'].get('name', 'Unnamed')} with {reviewer['contributions']} contributions marked as PotentialReviewer\")\n",
    "\n",
    "@staticmethod\n",
    "def _find_and_label_potential_reviewers(tx):\n",
    "    query = \"\"\"\n",
    "    MATCH (a:author)-[:WRITES]->(p:TopPaper)\n",
    "    WITH a, COUNT(p) AS contributions\n",
    "    SET a:PotentialReviewer\n",
    "    RETURN a AS Author, contributions\n",
    "    \"\"\"\n",
    "    results = tx.run(query)\n",
    "    return [{\"Author\": record[\"Author\"], \"contributions\": record[\"contributions\"]} for record in results]\n",
    "\n",
    "\n",
    "DatabaseCommunityRecommender.find_potential_reviewers = find_potential_reviewers\n",
    "DatabaseCommunityRecommender._find_and_label_potential_reviewers = _find_and_label_potential_reviewers\n",
    "recommender = DatabaseCommunityRecommender(\"neo4j://localhost:7687\", \"neo4j\", \"12345678\")\n",
    "recommender.find_potential_reviewers()\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "STEP8: Identifying Gurus"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Guru: P. Runeson with 2 top papers\n",
      "Guru: Martin Höst with 2 top papers\n",
      "Guru: P. Brereton with 3 top papers\n",
      "Guru: D. Budgen with 2 top papers\n",
      "Guru: B. Kitchenham with 3 top papers\n",
      "Guru: Thomas D. LaToza with 2 top papers\n",
      "Guru: N. Mulder with 2 top papers\n",
      "Guru: B. Daigle with 2 top papers\n",
      "Guru: H. Moseley with 2 top papers\n",
      "Guru: M. Farman with 2 top papers\n",
      "Guru: N. Moore with 2 top papers\n",
      "Guru: J. Jaromczyk with 2 top papers\n",
      "Guru: S. Chiu with 2 top papers\n",
      "Guru: J. Izatt with 2 top papers\n",
      "Guru: Sina Farsiu with 2 top papers\n",
      "Guru: A. Torralba with 2 top papers\n"
     ]
    }
   ],
   "source": [
    "class DatabaseCommunityRecommender:\n",
    "    def __init__(self, uri, user, password):\n",
    "        self.driver = GraphDatabase.driver(uri, auth=(user, password))\n",
    "\n",
    "    def close(self):\n",
    "        self.driver.close()\n",
    "\n",
    "    def find_gurus(self):\n",
    "        with self.driver.session() as session:\n",
    "            gurus = session.execute_write(self._find_and_label_gurus)\n",
    "            for guru in gurus:\n",
    "                print(f\"Guru: {guru['Author'].get('name', 'Unnamed')} with {guru['contributions']} top papers\")\n",
    "\n",
    "    @staticmethod\n",
    "    def _find_and_label_gurus(tx):\n",
    "        query = \"\"\"\n",
    "        MATCH (a:author)-[:WRITES]->(p:TopPaper)\n",
    "        WITH a, COUNT(p) AS contributions\n",
    "        WHERE contributions >= 2\n",
    "        SET a:Guru\n",
    "        RETURN a AS Author, contributions\n",
    "        \"\"\"\n",
    "        results = tx.run(query)\n",
    "        return [{\"Author\": result[\"Author\"], \"contributions\": result[\"contributions\"]} for result in results]\n",
    "\n",
    "\n",
    "uri = \"neo4j://localhost:7687\"\n",
    "user = \"neo4j\"\n",
    "password = \"12345678\"\n",
    "recommender = DatabaseCommunityRecommender(uri, user, password)\n",
    "recommender.find_gurus()\n",
    "recommender.close()\n"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.1"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
